/*
 ===========================================
 *	RETROF-16 Sample Program
 ===========================================
 */

//==========================================
	org(0);
	jmp(_start);	// 100番地へjmp.
//==========================================
	org(0x100);
_start:
	r15=0x100;	// Set Stack.
//==========================================
	r4=0;	// VRAM書き込みポインタ.
	r5=0;	// VRAM書き込みデータ
	do {
		do {
			ld(r5);
			#stv *r4

			r4++;
			and(0x1f);	// ポインタが32の倍数?
			if(z) {
				r5++;	// 書き込みデータを+1
				out(r4);// LEDの表示データ.
			}
		}while(r4 != 65527); //最後の7dotは書かない.
		r4=0;			// ポインタを0に戻す.
	}while(1);

//==========================================
//	以下の関数は未テスト(実行されない)
//==========================================
main()
{
	r8=1;
	sub();
	if(r15 >= 4) {
		r3++;
	}
}

sub()
{
	r4=r5;
	r4+=r6;
	r4-=3;
	r4-=267;
	sub(300);
	and(ffffh);
	r4|=0x1fff;
	r4&=0x55aa;

	ld(r255);
	st(r255);
}
