//-------------------------------------------
	org 0;  goto _start;

//	暗黙のレジスタ
at		equ	r13;		// assembler temp.
lr		equ	r14;		// link register.
sp		equ	r15;		// stack pointer.

//	ユーザー割り当てレジスタ
x		equ r16;
y		equ r17;
bc		equ	r18;
de		equ	r19;
hl		equ r20;
ix		equ r21;
a		equ	r22;
i		equ	r23;
j		equ	r24;
k		equ	r25;

//	定数equ.
r		equ	4;
g		equ	2;
b		equ	1;
w		equ	7;
b		equ	0;
c		equ	3;
p		equ	5;


	org 256;
/*-------------------------------------------
 *	スタートアップ.
 *-------------------------------------------
 */
_start:
	sp=0x100;
	main();
	halt;
/*-------------------------------------------
 *	データ
 *-------------------------------------------
 */
invdata:
	dot		0,0,0,0,0,0,0,0
	dot		0,0,0,g,g,g,0,0
	dot		0,0,g,g,g,g,g,0
	dot		0,g,0,g,g,g,0,g
	dot		0,0,g,g,g,g,g,0
	dot		0,0,0,g,0,g,0,0
	dot		0,0,g,0,0,0,g,0
	dot		0,0,0,0,0,0,0,0
/*-------------------------------------------
 *	メイン
 *-------------------------------------------
 */
main()
{
	subr();
}

/*-------------------------------------------
 *	サブ
 *-------------------------------------------
 */
subr()
{
	cls();
	k=0;do {
		//
		//	虫を画面いっぱいに敷き詰める.
		//	(x,y)は座標. ixはVRAMアドレス.
		y=0;do {
			x=0;do {
				ix=y;ix<<=7;	// 128倍.
				ix+=x;
				at=k;at>>=4;	// ix += (k/16) ずらし.
				ix+=at;
				
				putdata1();		//一匹虫を書く.
				x+=4;			//左へ８ドット.
			}while(x!=128);
			y+=8;				//下へ８ドット.
		}while(y!=256);
		k++;
		OUT	0;				//LEDを更新してみる.
	}while(1);				//無限ループ.
}

/*-------------------------------------------
 *	虫を一匹だけ書く.
 *-------------------------------------------
 *	引数
 *	ix : VRAMアドレス.
 */
putdata1()
{
	hl=ix;
	de=invdata;blit8x8();
}

/*-------------------------------------------
 *	画面を消す.
 *-------------------------------------------
 */
cls()
{
	hl=0;
	do {
		ld 0;
		stv([hl]);
		hl++;
	}while(hl!=0x8000);
//	}while(hl!=0x8);
}

/*-------------------------------------------
 *	画面に8x8のデータを書き込む.
 *-------------------------------------------
 *	引数:
 *		de: 8x8ドットデータの存在するアドレス
 *		hl:	書き込み先のVRAMアドレス.
 */
blit8x8()
{
	j=8;do {
		i=4;do {		// 8dot=4ワード.
			ld([de]);
			stv([hl]);
			hl++;
			de++;
		}while(--i);
		hl+=124;
	}while(--j);
}
/*-------------------------------------------
 *	以下、テストパターン.
 *-------------------------------------------
 */
test1()
{
	hl=1024;
	for(bc=0;bc<2000;bc++) {	// for文のテスト.
		if(de<hl) a++;
	}

test2:
	while(a!=100) {				// while文のテスト.
		bc++;
	}

test3:
	a=0;
	do {
		a++;
	}while(a==0x4a);			// do～while文のテスト.
test4:
	a=0;
	do {
		a++;
	}while(a<0x4a);				// do～while文のテスト(終了判定が不等式).
}



/*-------------------------------------------
 *	おまけ：ナイトライダー.
 *-------------------------------------------
 */
subr2()
{
	do {
		r80h = 7;
		r81h = 16;
		do {
			ld	r80h;
			OUT	0;
			do {
				r82h++;
			} while(nf);		//	} while(r82h != 0xFFFF) ;
			r80h <<= 1 ;
			r81h--;
		} while(nf);			//	if (r81h != (-1)) goto A0002;
	} while(1);
}
